lambda/src/test/resources/GuardianWeekly/QuarterlyDomestic/Subscription.json

{
  "success": true,
  "id": "8a1295807f6e0f46017f7276a660630b",
  "accountId": "2c92a0fd5a840403015aa9eaf85c572e",
  "accountNumber": "8014",
  "accountName": "8014",
  "invoiceOwnerAccountId": "2c92a0fd5a840403015aa9eaf85c572e",
  "invoiceOwnerAccountNumber": "8014",
  "invoiceOwnerAccountName": "8014",
  "subscriptionNumber": "8014",
  "version": 10,
  "revision": "10.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2002-06-13",
  "serviceActivationDate": "2002-06-13",
  "customerAcceptanceDate": "2016-12-03",
  "subscriptionStartDate": "2016-12-16",
  "subscriptionEndDate": "2023-03-10",
  "lastBookingDate": null,
  "termStartDate": "2022-03-10",
  "termEndDate": "2023-03-10",
  "initialTerm": 84,
  "initialTermPeriodType": "Day",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 12.50,
  "totalContractedValue": 869.93,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "03464",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "CM01",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a1295807f6e0f46017f7276a66b630d",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a00d6f9de7f6016f9f6f52765aa4",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "ratePlanCharges": [
        {
          "id": "8a1295807f6e0f46017f7276a673630f",
          "originalChargeId": "2c92a00b7bf223f5017bf37d63817548",
          "productRatePlanChargeId": "2c92a00d6f9de7f6016f9f6f529e5aaf",
          "number": "C-03151800",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP-2.89",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": -2.890000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-12-03",
          "effectiveEndDate": "2021-12-04",
          "processedThroughDate": "2021-12-04",
          "chargedThroughDate": "2021-12-04",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -2.890000000,
          "dtcv": -2.890000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2021-09-10",
          "HolidayEnd__c": "2021-09-10",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "8a1295807f6e0f46017f7276a6796312",
      "lastChangeType": "Remove",
      "productId": "2c92a0fd57d0a9870157d73fa27c3de1",
      "productName": "Guardian Weekly Zone A",
      "productSku": "ABC-00000017",
      "productRatePlanId": "2c92a0fd57d0a9870157d7412f19424f",
      "ratePlanName": "Guardian Weekly Quarterly",
      "ratePlanCharges": [
        {
          "id": "8a1295807f6e0f46017f7276a67d6314",
          "originalChargeId": "2c92a0fd5a840403015aaa7fa3ba7483",
          "productRatePlanChargeId": "2c92a0ff57d0a0b50157d752a0077624",
          "number": "C-00915408",
          "name": "Zone A Quarterly",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 4,
          "pricingSummary": "GBP30",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 30.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-12-03",
          "effectiveEndDate": "2019-03-03",
          "processedThroughDate": "2019-03-03",
          "chargedThroughDate": "2019-03-03",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.000000000,
          "dmrc": 0.000000000,
          "tcv": 270.000000000,
          "dtcv": -2.258064520,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "8a1295807f6e0f46017f7276a6806317",
      "lastChangeType": "Add",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fe6619b4b301661aa494392ee2",
      "ratePlanName": "GW Oct 18 - Quarterly - Domestic",
      "ratePlanCharges": [
        {
          "id": "8a1295807f6e0f46017f7276a6846319",
          "originalChargeId": "2c92a00868939e7201689f478bbf3e73",
          "productRatePlanChargeId": "2c92a0fe6619b4b601661aa8b74e623f",
          "number": "C-01513058",
          "name": "GW Oct 18 - Quarterly - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP37.5",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 37.500000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-03-03",
          "effectiveEndDate": "2023-03-10",
          "processedThroughDate": "2022-06-03",
          "chargedThroughDate": "2022-09-03",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 12.500000000,
          "dmrc": 0.000000000,
          "tcv": 602.822580650,
          "dtcv": 150.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}
