lambda/src/test/resources/GuardianWeekly/ZoneABC/ZoneB_USD_Annual/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2017-05-26",
  "serviceActivationDate": "2017-05-26",
  "customerAcceptanceDate": "2017-05-26",
  "subscriptionStartDate": "2017-05-26",
  "subscriptionEndDate": "2018-05-26",
  "lastBookingDate": null,
  "termStartDate": "2017-05-26",
  "termEndDate": "2018-05-26",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": false,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 20.00,
  "totalContractedValue": 240.00,
  "notes": "",
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "id",
      "productId": "2c92a0fe57d0a0c40157d74240d35541",
      "productName": "Guardian Weekly Zone B",
      "productSku": "ABC-00000019",
      "productRatePlanId": "2c92a0fe57d0a0c40157d74240de5543",
      "ratePlanName": "Guardian Weekly Annual",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0ff57d0a0b50157d759315607c5",
          "number": "C-01004750",
          "name": "Zone B Annual",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD240",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": 240.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-05-26",
          "effectiveEndDate": "2018-05-26",
          "processedThroughDate": "2018-05-26",
          "chargedThroughDate": "2018-05-26",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 20.000000000,
          "dmrc": 20.000000000,
          "tcv": 240.000000000,
          "dtcv": 240.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}
