lambda/src/test/resources/GuardianWeekly/ZoneABC/ZoneC_USD/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 12,
  "revision": "12.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2018-03-29",
  "serviceActivationDate": "2018-03-29",
  "customerAcceptanceDate": "2018-04-13",
  "subscriptionStartDate": "2018-03-29",
  "subscriptionEndDate": "2023-03-29",
  "lastBookingDate": null,
  "termStartDate": "2022-03-29",
  "termEndDate": "2023-03-29",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 21.67,
  "totalContractedValue": 1259.52,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": "IN",
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-02063522",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-07-13",
          "effectiveEndDate": "2020-07-14",
          "processedThroughDate": "2020-07-14",
          "chargedThroughDate": "2020-07-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-05-08",
          "HolidayEnd__c": "2020-05-08",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-02037938",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-07-13",
          "effectiveEndDate": "2020-07-14",
          "processedThroughDate": "2020-07-14",
          "chargedThroughDate": "2020-07-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-05-01",
          "HolidayEnd__c": "2020-05-01",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-02012034",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-07-13",
          "effectiveEndDate": "2020-07-14",
          "processedThroughDate": "2020-07-14",
          "chargedThroughDate": "2020-07-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-04-24",
          "HolidayEnd__c": "2020-04-24",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-01985899",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-07-13",
          "effectiveEndDate": "2020-07-14",
          "processedThroughDate": "2020-07-14",
          "chargedThroughDate": "2020-07-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-04-17",
          "HolidayEnd__c": "2020-04-17",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-01966240",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-04-13",
          "effectiveEndDate": "2020-04-14",
          "processedThroughDate": "2020-04-14",
          "chargedThroughDate": "2020-04-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-04-10",
          "HolidayEnd__c": "2020-04-10",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "C-01965900",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-04-13",
          "effectiveEndDate": "2020-04-14",
          "processedThroughDate": "2020-04-14",
          "chargedThroughDate": "2020-04-14",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -5.000000000,
          "dtcv": -5.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2020-04-03",
          "HolidayEnd__c": "2020-04-03",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fc5b42d2c9015b6259f7f40040",
      "ratePlanName": "Guardian Weekly Holiday Credit",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a00e6ad50f58016ad9ca59962c8c",
          "number": "C-01613571",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD0",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": 0.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-06-01",
          "effectiveEndDate": "2019-06-02",
          "processedThroughDate": "2019-06-02",
          "chargedThroughDate": "2019-06-02",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0ff5b42e3ad015b627c142f072a",
          "number": "C-01613572",
          "name": "Holiday Credit",
          "type": "Usage",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-43.34",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -43.340000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": "ByBillingPeriod",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-06-01",
          "effectiveEndDate": "2019-09-01",
          "processedThroughDate": "2019-09-01",
          "chargedThroughDate": "2019-09-01",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": null,
          "dtcv": null,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2019-06-07",
          "HolidayEnd__c": "2019-07-26",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "gwZoneC",
      "productId": "2c92a0ff58bdf4eb0158f307ecc102ad",
      "productName": "Guardian Weekly Zone C",
      "productSku": "ABC-00000022",
      "productRatePlanId": "2c92a0ff58bdf4eb0158f307ed0e02be",
      "ratePlanName": "Guardian Weekly Quarterly",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0ff58bdf4eb0158f307ed1e02c0",
          "number": "C-01279084",
          "name": "Zone C Quarterly",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "USD65",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": 65.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2018-04-13",
          "effectiveEndDate": "2023-03-29",
          "processedThroughDate": "2022-07-13",
          "chargedThroughDate": "2022-10-13",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 21.666666667,
          "dmrc": 0.000000000,
          "tcv": 1289.516129027,
          "dtcv": 260.000000000,
          "originalOrderDate": null,
          "amendedByOrderOn": "2022-03-29",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}
