lambda/src/test/resources/PercentageDiscount/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 4,
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2017-09-06",
  "serviceActivationDate": "2017-09-06",
  "customerAcceptanceDate": "2017-10-08",
  "subscriptionStartDate": "2017-09-06",
  "termStartDate": "2019-09-06",
  "termEndDate": "2020-09-06",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 10.79,
  "totalContractedValue": 376.95,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "VHD21A",
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": "GB",
  "PromotionCode__c": "VHD21A",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "id",
      "productId": "2c92a0fc55a0dc530155dfa5b8dd56c0",
      "productName": "Newspaper Voucher",
      "productSku": "ABC-00000014",
      "productRatePlanId": "2c92a0fe5af9a6b9015b0fe1ecc0116c",
      "ratePlanName": "Sunday",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fe5af9a6b9015b0fe1ed121177",
          "number": "C-01112220",
          "name": "Sunday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 3,
          "pricingSummary": "GBP10.79",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 10.790000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-10-08",
          "effectiveEndDate": "2020-09-06",
          "processedThroughDate": "2020-05-08",
          "chargedThroughDate": "2020-06-08",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.790000000,
          "dmrc": 0.000000000,
          "tcv": 376.953870968,
          "dtcv": 129.480000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "ratePlanName": "Percentage",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-01767304",
          "name": "Percentage",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-01-08",
          "effectiveEndDate": "2020-09-06",
          "processedThroughDate": "2020-05-08",
          "chargedThroughDate": "2020-06-08",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}
