lambda/src/test/resources/SemiAnnualVoucher/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 5,
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2009-01-26",
  "serviceActivationDate": "2009-01-26",
  "customerAcceptanceDate": "2016-11-07",
  "subscriptionStartDate": "2016-08-14",
  "termStartDate": "2020-01-13",
  "termEndDate": "2021-01-13",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 36.79,
  "totalContractedValue": 1986.66,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "PA01",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "rp42",
      "productId": "2c92a0fc55a0dc530155dfa5b8dd56c0",
      "productName": "Newspaper Voucher",
      "productSku": "ABC-00000014",
      "productRatePlanId": "2c92a0fd56fe270b0157040e42e536ef",
      "ratePlanName": "Sixday",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fd56fe26b601570431210a310e",
          "number": "C-00500175",
          "name": "Monday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP34.22",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 34.220000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.703333333,
          "dmrc": 0.000000000,
          "tcv": 307.980000000,
          "dtcv": 68.440000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fd56fe270b015709be701e78b6",
          "number": "C-00500186",
          "name": "Thursday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP34.22",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 34.220000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.703333333,
          "dmrc": 0.000000000,
          "tcv": 307.980000000,
          "dtcv": 68.440000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0ff56fe33f5015709bf7fdd6a4d",
          "number": "C-00500195",
          "name": "Saturday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP49.64",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 49.640000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 8.273333333,
          "dmrc": 0.000000000,
          "tcv": 446.760000000,
          "dtcv": 99.280000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fd56fe270b015709bd2d3d75d7",
          "number": "C-00500180",
          "name": "Tuesday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP34.22",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 34.220000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.703333333,
          "dmrc": 0.000000000,
          "tcv": 307.980000000,
          "dtcv": 68.440000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fc56fe26ba015709bee15d653a",
          "number": "C-00500168",
          "name": "Friday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP34.22",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 34.220000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.703333333,
          "dmrc": 0.000000000,
          "tcv": 307.980000000,
          "dtcv": 68.440000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        },
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fe56fe33ff015709bdb6153cd4",
          "number": "C-00500191",
          "name": "Wednesday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP34.22",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 34.220000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Semi_Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-07-13",
          "effectiveEndDate": "2021-01-13",
          "processedThroughDate": "2020-01-13",
          "chargedThroughDate": "2020-07-13",
          "done": false,
          "triggerDate": "2016-07-13",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.703333333,
          "dmrc": 0.000000000,
          "tcv": 307.980000000,
          "dtcv": 68.440000000,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}
