lambda/src/test/resources/model/AmendmentData/Sunday/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 3,
  "revision": "3.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2021-10-24",
  "serviceActivationDate": "2021-10-24",
  "customerAcceptanceDate": "2021-10-31",
  "subscriptionStartDate": "2021-10-24",
  "subscriptionEndDate": "2022-10-24",
  "termStartDate": "2021-10-24",
  "termEndDate": "2022-10-24",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 16.99,
  "totalContractedValue": 191.54,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": "CSR",
  "CreatedByCSR__c": "Julie Dempster",
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": "5005I00000KsBHQQA3",
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "ratePlans": [
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
          "number": "C-03221562",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP-4.25",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": -4.250000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-11-30",
          "effectiveEndDate": "2021-12-01",
          "processedThroughDate": "2021-12-01",
          "chargedThroughDate": "2021-12-01",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -4.250000000,
          "dtcv": -4.250000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2021-11-07",
          "HolidayEnd__c": "2021-11-07",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
          "number": "C-03211942",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP-4.25",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": -4.250000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-11-30",
          "effectiveEndDate": "2021-12-01",
          "processedThroughDate": "2021-12-01",
          "chargedThroughDate": "2021-12-01",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -4.250000000,
          "dtcv": -4.250000000,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2021-10-31",
          "HolidayEnd__c": "2021-10-31",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "productId": "2c92a0ff55a0e4940155dfa589da2591",
      "productName": "Newspaper Delivery",
      "productSku": "ABC-00000013",
      "productRatePlanId": "2c92a0ff5af9b657015b0fea5b653f81",
      "ratePlanName": "Sunday",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92a0ff5af9b657015b0fea5bb83fa8",
          "number": "C-03202367",
          "name": "Sunday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP16.99",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 16.990000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-10-31",
          "effectiveEndDate": "2022-10-24",
          "processedThroughDate": "2022-01-31",
          "chargedThroughDate": "2022-02-28",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 16.990000000,
          "dmrc": 16.990000000,
          "tcv": 200.043548381,
          "dtcv": 200.043548381,
          "originalOrderDate": null,
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}